vlm/extension/Documents/ЗаданиеНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Паспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПриобретениеУслугПеревозки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_КоличествоМестИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Оплата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПунктов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КурьерЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеВыполняет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсполнителейЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Enums/ТипыИсполнителейЗаданийНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыИсполнителейЗаданийНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашаТранспортнаяСлужба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Enums/ВидыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоСклада</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ЗаданиеНаПеревозку/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
&Перед("ПриСозданииНаСервере")
Процедура бит_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [14.06.2024 8:00:00] + 	
	НовыйЭлемент = Элементы.Вставить("бит_СуммаОплаты", Тип("ПолеФормы"), Элементы.ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_СуммаОплаты";  
	
	НовыйЭлемент = Элементы.Вставить("бит_Паспорт", Тип("ПолеФормы"), Элементы.ГруппаВодитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Паспорт"; 
	
	НовыйЭлемент = Элементы.Вставить("бит_Телефон", Тип("ПолеФормы"), Элементы.ГруппаВодитель);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Телефон"; 
	// {{ПервыйБИТ ЛистТребований [22]  [AVZhelansky@1cbit.ru] [14.06.2024 8:00:00] -
	
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.5] [AVZhelansky@1cbit.ru] [18.06.2025 15:21:51] +
	НовыйЭлемент = Элементы.Добавить("бит_ПриобретениеУслугПеревозки", Тип("ПолеФормы"), Элементы.ГруппаПраво);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_ПриобретениеУслугПеревозки";
    НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_ПриобретениеУслугПеревозкиПриИзменении");
	
	НовыйЭлемент = Элементы.Добавить("бит_ГруппаОплата", Тип("ГруппаФормы"), Элементы.ГруппаПраво);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Объединенная = Истина ;
	НовыйЭлемент.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	
	НовыйЭлемент = Элементы.Вставить("бит_ЗаголовокОплата", Тип("ДекорацияФормы"), Элементы.бит_ГруппаОплата);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = "(бит) Оплата";  
	НовыйЭлемент.Ширина = 22;  
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("бит_ДекорацияСостояниеРасчетов", Тип("ДекорацияФормы"), Элементы.бит_ГруппаОплата);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Гиперссылка = Истина;
	//НовыйЭлемент.УстановитьДействие("Нажатие", "бит_ДекорацияСостояниеРасчетовНажатиеНаКлиенте"); 
	
	бит_ОбновитьТекстГиперссылкиСостояниеРасчетов();
	
    // }}ПервыйБИТ ЛистТребовани [ЛТ 2.5] [AVZhelansky@1cbit.ru] [18.06.2025 15:21:52] -	

	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:26:55] +        
	НовыйЭлемент = Элементы.Вставить("бит_Договор", Тип("ПолеФормы"), Элементы.ГруппаЛево, Элементы.ТранспортноеСредство);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.бит_Договор"; 
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:26:55] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПриобретениеУслугПеревозкиПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 18:57:52] +  
	бит_ОбновитьТекстГиперссылкиСостояниеРасчетов();		
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 18:57:55] -
КонецПроцедуры

&НаСервере
Процедура бит_ПриобретениеУслугПеревозкиПриИзмененииНаСервере()
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 18:57:52] +  
	Если ЗначениеЗаполнено(Объект.бит_ПриобретениеУслугПеревозки) Тогда
		ДокОбъект = Объект.бит_ПриобретениеУслугПеревозки.ПолучитьОбъект();                  
		бит_СтруктураПараметров = Документы.ПриобретениеУслугПрочихАктивов.ПараметрыВзаиморасчеты(ДокОбъект);
		бит_СостояниеВзаиморасчетов = ВзаиморасчетыСервер.СостояниеВзаиморасчетов(ДокОбъект, бит_СтруктураПараметров);
		бит_ОбновитьТекстГиперссылкиСостояниеРасчетов();
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 18:57:55] -
КонецПроцедуры

&НаСервере
Процедура бит_ОбновитьТекстГиперссылкиСостояниеРасчетов()
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [19.06.2025 22:27:54] +
	
	ЭлементНадписьРасчеты = ЭтаФорма.Элементы.бит_ДекорацияСостояниеРасчетов;
	
	Если ЗначениеЗаполнено(Объект.бит_ПриобретениеУслугПеревозки) Тогда
		
		ДокументПриобретения = Объект.бит_ПриобретениеУслугПеревозки;
		ВалютаВзаиморасчетов  = ДокументПриобретения.ВалютаВзаиморасчетов;
		ЭлементНадписьРасчеты = ЭтаФорма.Элементы.бит_ДекорацияСостояниеРасчетов; 
		
		ТекстПредупреждения = "";
		//Если НЕ ВзаиморасчетыСервер.ОтложенноеОбновлениеРегистровВзаиморасчетовЗавершено() Тогда
		//	ТекстПредупреждения = НСтр("ru = 'Данные могут быть неточными, выполняется обновление ИБ.';
		//	|en = 'The data might be inaccurate. Updating the infobase.'");
		//КонецЕсли;
		
		СостояниеВзаиморасчетов = бит_СостояниеВзаиморасчетов(ДокументПриобретения);
		СуммаОплат   = Макс(0, СостояниеВзаиморасчетов.СуммаОплат);
		ПроцентОплат = Макс(0, бит_ОкруглитьПроценты(СостояниеВзаиморасчетов.ПроцентОплат));
		
		ЭлементНадписьРасчеты.Заголовок = НСтр("ru = 'Оплачено';
		|en = 'Amount paid'") + ": " + Формат(СуммаОплат, "ЧДЦ=2; ЧН=") + " " + ВалютаВзаиморасчетов + " " + ПроцентОплат + "%"
		+ ?(ПустаяСтрока(ТекстПредупреждения), "", " ") + ТекстПредупреждения; 
		
	Иначе
		
		ЭлементНадписьРасчеты.Заголовок = НСтр("ru = 'Оплачено';
		|en = 'Amount paid'") + ": 0.00 руб. 0%";
		
	КонецЕсли;
		
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [19.06.2025 22:27:59] -
КонецПроцедуры

&НаСервере
Функция бит_СостояниеВзаиморасчетов(ДокументПриобретения) 
	
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [24.06.2025 17:05:58] +
	СуммаВзаиморасчетов = ?(ДокументПриобретения.СуммаВзаиморасчетов = 0 ,ДокументПриобретения.СуммаДокумента, ДокументПриобретения.СуммаВзаиморасчетов);
	Организация         = ДокументПриобретения.Организация;
	ТипРасчетов         = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	ПорядокРасчетов     = ДокументПриобретения.ПорядокРасчетов;
	
	ОбъектРасчетов = ДокументПриобретения.ОбъектРасчетов;
	Если ТипЗнч(ОбъектРасчетов) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(ОбъектРасчетов, ПредопределенноеЗначение("Справочник.ОбъектыРасчетов.ПустаяСсылка"));
		ОбъектРасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОбъектРасчетов);
		Если ОбъектРасчетов.Количество() = 1 Тогда
			ОбъектРасчетов = ОбъектРасчетов[0];
			СуммаВзаиморасчетов = 0;
		Иначе
			ОбъектРасчетов = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВзаиморасчетыСервер.СостояниеВзаиморасчетовОбъектаРасчетов(ОбъектРасчетов, СуммаВзаиморасчетов, ТипРасчетов, Организация, Ложь, Ложь);
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [24.06.2025 17:06:04] - 
	
КонецФункции 

Функция бит_ПолучитьМассивЗаказовИзТЧ(Объект, СтруктураПараметров)
// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [19.06.2025 22:31:04] +	
	МассивЗаказов = Новый Массив;
	ТЧ = ОбщегоНазначенияУТКлиентСервер.ДанныеПоПути(Объект, СтруктураПараметров.ПутьКДаннымТЧ);
	Если ЗначениеЗаполнено(ТЧ) И ЗначениеЗаполнено(СтруктураПараметров.ИмяРеквизитаТЧЗаказ) Тогда
		Заказы = ТЧ.Выгрузить(, СтруктураПараметров.ИмяРеквизитаТЧЗаказ);
		Заказы.Свернуть(СтруктураПараметров.ИмяРеквизитаТЧЗаказ,);
		МассивЗаказов = Заказы.ВыгрузитьКолонку(СтруктураПараметров.ИмяРеквизитаТЧЗаказ);
		
		сч = 0;
		Пока сч < МассивЗаказов.Количество() Цикл
			Если Не ЗначениеЗаполнено(МассивЗаказов[сч]) Тогда
				МассивЗаказов.Удалить(сч);
			Иначе
				сч= сч + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивЗаказов;
// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [19.06.2025 22:31:06] -	
Конецфункции

&НаКлиенте
Процедура бит_ДекорацияСостояниеРасчетовНажатиеНаКлиенте(Элемент, СтандартнаяОбработка)
	
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [24.06.2025 17:07:20] + 
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = бит_ПолучитьСтруктуруПараметровРасчетов();
	
	Если Не СтруктураПараметров = Неопределено Тогда
		ВзаиморасчетыКлиентСервер.ПроверитьОбязательныеПараметры(СтруктураПараметров,
		"Дата, ВалютаДокумента, Договор, СуммаДокумента");
		
		ПараметрОтчета = СтруктураПараметров.ОбъектРасчетов;
		
		Если ТипЗнч(ПараметрОтчета) = Тип("Массив") Тогда
			ПараметрОтчета = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПараметрОтчета);
			Если ПараметрОтчета.Количество() = 1 Тогда
				ПараметрОтчета = ПараметрОтчета[0];
			КонецЕсли;
		КонецЕсли;
		
		ОтчетыУТКлиентПереопределяемый.ОткрытьОтчетКарточкаРасчетовСПоставщиками("КарточкаРасчетовСПоставщикамиПоДокументамКонтекст", ПараметрОтчета);
	КонецЕсли;
    // }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [24.06.2025 17:07:23] -
	
КонецПроцедуры	

&НаСервере
Функция бит_ПолучитьСтруктуруПараметровРасчетов()
	
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] + 
	Если ЗначениеЗаполнено(Объект.бит_ПриобретениеУслугПеревозки) Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Дата", Объект.бит_ПриобретениеУслугПеревозки.Дата);
		СтруктураПараметров.Вставить("ВалютаДокумента", Объект.бит_ПриобретениеУслугПеревозки.Валюта); 
		СтруктураПараметров.Вставить("Договор", Объект.бит_ПриобретениеУслугПеревозки.Договор); 
		СтруктураПараметров.Вставить("СуммаДокумента", Объект.бит_ПриобретениеУслугПеревозки.СуммаДокумента);
		СтруктураПараметров.Вставить("ОбъектРасчетов", Объект.бит_ПриобретениеУслугПеревозки.Ссылка);
		
		Возврат СтруктураПараметров;  
		
	Иначе   
		
		Возврат Неопределено;  
		
	КонецЕсли;
	// ПервыйБИТ ЛистТребований [23]  [Пасенов В.В.] [26.06.2024] - 

КонецФункции

&НаСервере
Функция бит_ОкруглитьПроценты(ОкругляемоеЧисло)
	
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [24.06.2025 17:06:08] +
	Если ОкругляемоеЧисло > 99
		И ОкругляемоеЧисло < 100 Тогда
		Результат = 99;
	ИначеЕсли ОкругляемоеЧисло > 0
		И ОкругляемоеЧисло < 1 Тогда
		Результат = 1;
	Иначе
		Результат = Окр(ОкругляемоеЧисло);
	КонецЕсли;
	
	Возврат Результат; 
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [24.06.2025 17:06:11] -
	
КонецФункции

&НаСервере
&ИзменениеИКонтроль("НастроитьПоТипуИсполнителя")
Процедура бит_НастроитьПоТипуИсполнителя()

	ВыполняетПеревозчик = Объект.ЗаданиеВыполняет = Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик;

	Элементы.Перевозчик.Видимость             = ВыполняетПеревозчик;
	Элементы.Водитель.Видимость               = Не ВыполняетПеревозчик;
	Элементы.КурьерЭкспедитор.Видимость       = Не ВыполняетПеревозчик;
	#Удаление
	Элементы.ИнформацияОТСИВодителе.Видимость = ВыполняетПеревозчик
	И Объект.Операция = Перечисления.ВидыДоставки.СоСклада;
	#КонецУдаления

	Если ВыполняетПеревозчик
		И ЗначениеЗаполнено(Объект.Перевозчик) Тогда

		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ЗаполнитьКонтрагентаИБанковскийСчетПеревозчика();
		КонецЕсли;

	Иначе
		#Удаление
		Объект.Перевозчик = Справочники.Партнеры.ПустаяСсылка(); 
		#КонецУдаления
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.БанковскийСчетПеревозчика = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
		
		#Удаление
		Перевозчик = Объект.Перевозчик;
		#КонецУдаления
	КонецЕсли;

	ЗаполнитьСпискиВыбораВодителейИТС();

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПослеПодбораРаспоряженийСервер")
Процедура бит_ПослеПодбораРаспоряженийСервер(СтруктураВозврата)

	Распоряжения = ПолучитьИзВременногоХранилища(СтруктураВозврата.АдресРаспоряжений);
	Товары = ПолучитьИзВременногоХранилища(СтруктураВозврата.АдресТоваров);
    #Удаление
	Запрос = Новый Запрос(ТекстЗапросаИзмененныеДобавленныеСтрокиРаспоряжений());
	#КонецУдаления
	#Вставка
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:08:54] +
	Запрос = Новый Запрос(бит_ТекстЗапросаИзмененныеДобавленныеСтрокиРаспоряжений());
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:08:57] -
	#КонецВставки
	Запрос.УстановитьПараметр("ИсходнаяТаблица",Объект.Распоряжения.Выгрузить());
	Запрос.УстановитьПараметр("ПодобранныеРаспоряжения", Распоряжения);
	Запрос.УстановитьПараметр("ИсходныеТовары", ТоварыКДоставке.Выгрузить());
	Запрос.УстановитьПараметр("ПодобранныеТовары", Товары);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Модифицированность = Не РезультатЗапроса[5].Пустой()
	Или Не РезультатЗапроса[6].Пустой()
	Или Не РезультатЗапроса[7].Пустой();

	ИзмененныеДобавленныеСтроки = Новый Массив; // Массив из ДанныеФормыЭлементКоллекции
	СтрокаМаршрута = Неопределено;

	СтруктураПоиска = Новый Структура("Распоряжение,Склад");

	ВыборкаИзмененныеСтроки = РезультатЗапроса[5].Выбрать();

	Пока ВыборкаИзмененныеСтроки.Следующий() Цикл

		СтрокаРаспоряжений = Объект.Распоряжения[ВыборкаИзмененныеСтроки.НомерСтроки - 1];
		ИзменениеВес = ВыборкаИзмененныеСтроки.Вес - СтрокаРаспоряжений.Вес;
		ИзменениеОбъем = ВыборкаИзмененныеСтроки.Объем - СтрокаРаспоряжений.Объем;
		#Вставка
		// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:04:51] +
		бит_ИзменениеКоличествоМест = ВыборкаИзмененныеСтроки.бит_КоличествоМест - СтрокаРаспоряжений.бит_КоличествоМест;
		// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:04:53] -
		#КонецВставки
		ЗаполнитьЗначенияСвойств(СтрокаРаспоряжений, ВыборкаИзмененныеСтроки);
		ИзменитьВесОбъемМаршрута(СтрокаРаспоряжений.КлючСвязи, ИзменениеВес, ИзменениеОбъем);
		#Вставка
		// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 15:43:20] +
		бит_ИзменитьКоличествоМестМаршрута(СтрокаРаспоряжений.КлючСвязи, бит_ИзменениеКоличествоМест);
		// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 15:43:23] -
		#КонецВставки
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРаспоряжений);
		// Товары будут заново добавлены, удалим строки до изменения
		Для Каждого СтрокаТовары Из ТоварыКДоставке.НайтиСтроки(СтруктураПоиска) Цикл
			ТоварыКДоставке.Удалить(СтрокаТовары);
		КонецЦикла;
		ИзмененныеДобавленныеСтроки.Добавить(СтрокаРаспоряжений);
	КонецЦикла;

	ВыборкаДобавляемыеСтроки = РезультатЗапроса[6].Выбрать();
	Пока ВыборкаДобавляемыеСтроки.Следующий() Цикл

		СтрокаРаспоряжений = Объект.Распоряжения.Добавить(); 
		ЗаполнитьЗначенияСвойств(СтрокаРаспоряжений, ВыборкаДобавляемыеСтроки);

		СтрокаМаршрута = ДоставкаТоваров.ДобавитьИзменитьПунктПоРеквизитамДоставки(
		Объект.Маршрут, ВыборкаДобавляемыеСтроки, Объект.ДатаВремяРейсаПланС);

		СтрокаРаспоряжений.КлючСвязи = СтрокаМаршрута.КлючСвязи;

		ИзмененныеДобавленныеСтроки.Добавить(СтрокаРаспоряжений);

	КонецЦикла;

	ТоварыИзмененныхИДобавленныхРаспоряжений = РезультатЗапроса[7].Выгрузить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТоварыИзмененныхИДобавленныхРаспоряжений, ТоварыКДоставке);

	ОбновитьИтоговыйВесОбъемЗаполненность(ЭтотОбъект);

	ОбновитьСкладыПогрузки();
	ЗаполнитьСлужебныеРеквизитыМаршрута();
	ДоставкаТоваров.ЗаполнитьПризнакДоставляетсяПолностью(ТоварыИзмененныхИДобавленныхРаспоряжений,
	Объект.Распоряжения, ИзмененныеДобавленныеСтроки);

	Если СтрокаМаршрута <> Неопределено Тогда
		Элементы.Маршрут.ТекущаяСтрока = СтрокаМаршрута.ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры   

&НаСервере
Процедура бит_ИзменитьКоличествоМестМаршрута(КлючСвязи, бит_ИзменениеКоличествоМест)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 15:46:40] +
	СтрокаМаршрута = СтрокаМаршрутаПоКлючуСвязи(КлючСвязи);
	СтрокаМаршрута.бит_КоличествоМест = СтрокаМаршрута.бит_КоличествоМест;// + бит_ИзменениеКоличествоМест;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 15:46:42] -
КонецПроцедуры

&НаСервере
Функция бит_ТекстЗапросаИзмененныеДобавленныеСтрокиРаспоряжений()
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:15:13] +
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ИсходнаяТаблица.Распоряжение КАК Распоряжение,
	|	ИсходнаяТаблица.Склад КАК Склад,
	|	ИсходнаяТаблица.Вес КАК Вес,
	|	ИсходнаяТаблица.Объем КАК Объем,
	|	ИсходнаяТаблица.бит_КоличествоМест КАК бит_КоличествоМест
	|ПОМЕСТИТЬ ИсходнаяТаблица
	|ИЗ
	|	&ИсходнаяТаблица КАК ИсходнаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеРаспоряжения.Распоряжение КАК Распоряжение,
	|	ПодобранныеРаспоряжения.Вес КАК Вес,
	|	ПодобранныеРаспоряжения.Объем КАК Объем,
	|	ПодобранныеРаспоряжения.Перевозчик КАК Перевозчик,
	|	ПодобранныеРаспоряжения.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ПодобранныеРаспоряжения.ВремяС КАК ВремяС,
	|	ПодобранныеРаспоряжения.ВремяПо КАК ВремяПо,
	|	ПодобранныеРаспоряжения.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ПодобранныеРаспоряжения.Склад КАК Склад,
	|	ПодобранныеРаспоряжения.Адрес КАК Адрес,
	|	ПодобранныеРаспоряжения.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ПодобранныеРаспоряжения.Зона КАК Зона,
	|	ПодобранныеРаспоряжения.бит_КоличествоМест КАК бит_КоличествоМест
	|ПОМЕСТИТЬ ПодобранныеРаспоряжения
	|ИЗ
	|	&ПодобранныеРаспоряжения КАК ПодобранныеРаспоряжения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходныеТовары.Распоряжение КАК Распоряжение,
	|	ИсходныеТовары.Склад КАК Склад,
	|	ИсходныеТовары.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ИсходныеТовары.Номенклатура КАК Номенклатура,
	|	ИсходныеТовары.Характеристика КАК Характеристика,
	|	ИсходныеТовары.Назначение КАК Назначение,
	|	ИсходныеТовары.Серия КАК Серия,
	|	ИсходныеТовары.Количество КАК Количество,
	|	ИсходныеТовары.ВсеТовары КАК ВсеТовары
	|ПОМЕСТИТЬ ИсходныеТовары
	|ИЗ
	|	&ИсходныеТовары КАК ИсходныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеТовары.Распоряжение КАК Распоряжение,
	|	ПодобранныеТовары.Склад КАК Склад,
	|	ПодобранныеТовары.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ПодобранныеТовары.Номенклатура КАК Номенклатура,
	|	ПодобранныеТовары.Характеристика КАК Характеристика,
	|	ПодобранныеТовары.Назначение КАК Назначение,
	|	ПодобранныеТовары.Серия КАК Серия,
	|	ПодобранныеТовары.Количество КАК Количество,
	|	ПодобранныеТовары.ВсеТовары КАК ВсеТовары
	|ПОМЕСТИТЬ ПодобранныеТовары
	|ИЗ
	|	&ПодобранныеТовары КАК ПодобранныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияСвернутые.Распоряжение КАК Распоряжение,
	|	РаспоряженияСвернутые.Склад КАК Склад,
	|	СУММА(РаспоряженияСвернутые.Вес) КАК Вес,
	|	СУММА(РаспоряженияСвернутые.Объем) КАК Объем,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИсходнаяТаблица.Распоряжение ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ИзмененнаяСтрока,
	|	СУММА(РаспоряженияСвернутые.бит_КоличествоМест) КАК бит_КоличествоМест
	|ПОМЕСТИТЬ РаспоряженияСвернутые
	|ИЗ
	|	ПодобранныеРаспоряжения КАК РаспоряженияСвернутые
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИсходнаяТаблица КАК ИсходнаяТаблица
	|		ПО (ИсходнаяТаблица.Распоряжение = РаспоряженияСвернутые.Распоряжение)
	|			И (ИсходнаяТаблица.Склад = РаспоряженияСвернутые.Склад)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияСвернутые.Склад,
	|	РаспоряженияСвернутые.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзмененныеСтроки.Вес КАК Вес,
	|	ИзмененныеСтроки.Объем КАК Объем,
	|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ИзмененныеСтроки.бит_КоличествоМест КАК бит_КоличествоМест
	|ИЗ
	|	РаспоряженияСвернутые КАК ИзмененныеСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходнаяТаблица КАК ИсходнаяТаблица
	|		ПО (ИсходнаяТаблица.Распоряжение = ИзмененныеСтроки.Распоряжение)
	|			И (ИсходнаяТаблица.Склад = ИзмененныеСтроки.Склад)
	|ГДЕ
	|	ИзмененныеСтроки.ИзмененнаяСтрока
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДобавляемыеСтроки.Распоряжение КАК Распоряжение,
	|	РаспоряженияСвернутые.Вес КАК Вес,
	|	ДобавляемыеСтроки.Объем КАК Объем,
	|	ДобавляемыеСтроки.Перевозчик КАК Перевозчик,
	|	ДобавляемыеСтроки.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ДобавляемыеСтроки.ВремяС КАК ВремяС,
	|	ДобавляемыеСтроки.ВремяПо КАК ВремяПо,
	|	ДобавляемыеСтроки.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ДобавляемыеСтроки.Склад КАК Склад,
	|	ДобавляемыеСтроки.Адрес КАК Адрес,
	|	ДобавляемыеСтроки.АдресЗначенияПолей КАК АдресЗначенияПолей,
	|	ДобавляемыеСтроки.Зона КАК Зона,
	|	ДобавляемыеСтроки.Распоряжение ССЫЛКА Документ.ПоручениеЭкспедитору КАК ЭтоПоручениеЭкспедитору,
	|	ДобавляемыеСтроки.бит_КоличествоМест КАК бит_КоличествоМест
	|ИЗ
	|	ПодобранныеРаспоряжения КАК ДобавляемыеСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РаспоряженияСвернутые КАК РаспоряженияСвернутые
	|		ПО (РаспоряженияСвернутые.Распоряжение = ДобавляемыеСтроки.Распоряжение)
	|			И (РаспоряженияСвернутые.Склад = ДобавляемыеСтроки.Склад)
	|			И (НЕ РаспоряженияСвернутые.ИзмененнаяСтрока)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодобранныеТовары.Распоряжение КАК Распоряжение,
	|	ПодобранныеТовары.Склад КАК Склад,
	|	ПодобранныеТовары.ПолучательОтправитель КАК ПолучательОтправитель,
	|	ПодобранныеТовары.Номенклатура КАК Номенклатура,
	|	ПодобранныеТовары.Характеристика КАК Характеристика,
	|	ПодобранныеТовары.Назначение КАК Назначение,
	|	ПодобранныеТовары.Серия КАК Серия,
	|	ПодобранныеТовары.Количество КАК Количество,
	|	ПодобранныеТовары.ВсеТовары КАК ВсеТовары
	|ИЗ
	|	ПодобранныеТовары КАК ПодобранныеТовары";
	
	Возврат ТекстЗапроса;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:15:18] -
КонецФункции

&НаКлиентеНаСервереБезКонтекста
&После("ОбновитьИтоговыйВесОбъемЗаполненность")
Процедура бит_ОбновитьИтоговыйВесОбъемЗаполненность(Форма)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:49:54] +
	бит_ОбновитьКоличествоМест(Форма);
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:49:57] -
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура бит_ОбновитьКоличествоМест(Форма)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:49:54] +
	бит_КоличествоМест = Форма.Объект.Маршрут.Итог("бит_КоличествоМест"); 
	ДанныеКоличествоМест = Новый Структура;
	ДанныеКоличествоМест.Вставить("бит_КоличествоМест", бит_КоличествоМест);
	ДанныеКоличествоМест.Вставить("бит_КоличествоМестПлан", Форма.бит_КоличествоМестПлан);
	бит_КонтрольКоличестваМестКлиентСервер.бит_ОтобразитьНехваткуМеста(Форма, ДанныеКоличествоМест);
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 16:49:57] -
КонецПроцедуры

&НаСервере
&Перед("ПриЧтенииСозданииНаСервере")
Процедура бит_ПриЧтенииСозданииНаСервере()
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 9:41:34] +
	Если Элементы.Найти("бит_КоличествоМест") = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить("бит_КоличествоМест", Тип("ПолеФормы"), Элементы.Маршрут, Элементы.МаршрутДополнительнаяИнформация);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода; 
		НовыйЭлемент.ПутьКДанным = "Объект.Маршрут.бит_КоличествоМест";	 
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "бит_бит_КоличествоМестПриИзменении");
		
		МассивДобавляемыхРеквизитов = Новый Массив;  
		ТипРеквизитаФорматированнаяСтрока = Новый ОписаниеТипов("ФорматированнаяСтрока");
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("бит_НадписьКоличествоМест", ТипРеквизитаФорматированнаяСтрока)); 
		КЧ = Новый КвалификаторыЧисла(5,0);
		ТипРеквизитаЧисло = Новый ОписаниеТипов("Число",,,КЧ);
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("бит_КоличествоМестПлан", ТипРеквизитаЧисло,,,Истина));	
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);	
		
		ЭтотОбъект.бит_КоличествоМестПлан = бит_ПолучитьКоличествоМестПлан();
		
		НовыйЭлемент = Элементы.Добавить("бит_НадписьКоличествоМест", Тип("ПолеФормы"), Элементы.ГруппаЗаданияПодвал);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи; 
		НовыйЭлемент.ПутьКДанным = "бит_НадписьКоличествоМест"; 
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь; 
		НовыйЭлемент.Ширина = 20;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.МаксимальнаяШирина = 20;
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		
		НовыйЭлемент = Элементы.Добавить("бит_ДекорацияКоличествоМест", Тип("ДекорацияФормы"), Элементы.ГруппаЗаданияПодвал);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка; 
		НовыйЭлемент.Картинка = БиблиотекаКартинок.Состояние33Процента;
		НовыйЭлемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;  
		НовыйЭлемент.Подсказка = "Нехватка или превышение по количеству мест";
		НовыйЭлемент.Ширина = 2;
		НовыйЭлемент.Высота = 1; 
	КонецЕсли;	
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 9:41:36] -
КонецПроцедуры

&НаСервере
Функция бит_ПолучитьКоличествоМестПлан()
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 20:02:20] +
	Если ТипЗнч(Объект.ТранспортноеСредство) = Тип("СправочникСсылка.ТранспортныеСредства")
		И ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТранспортноеСредство, "бит_КоличествоМест");
	ИначеЕсли ТипЗнч(Объект.ТранспортноеСредство) = Тип("СправочникСсылка.ТипыТранспортныхСредств") 
		И ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТранспортноеСредство, "бит_КоличествоМест");
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 20:02:22] -
КонецФункции

&НаКлиенте
&После("ТранспортноеСредствоПриИзменении")
Процедура бит_ТранспортноеСредствоПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 18:57:52] +
	бит_КоличествоМестПлан = бит_ПолучитьКоличествоМестПлан();
	бит_ОбновитьКоличествоМест(ЭтаФорма);
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 18:57:55] -
КонецПроцедуры  

&НаКлиенте
Процедура бит_бит_КоличествоМестПриИзменении(Элемент)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 18:57:52] +
	бит_КоличествоМестПлан = бит_ПолучитьКоличествоМестПлан();
	бит_ОбновитьКоличествоМест(ЭтаФорма);
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 18:57:55] -
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ОбъединитьСтрокиМаршрута")
Функция бит_ОбъединитьСтрокиМаршрута(ВыделенныеСтроки, МассивКодовСтрок)

	СтрокаМаршрута = Объект.Маршрут.НайтиПоИдентификатору(ВыделенныеСтроки[0]);
	НовыйКлючСвязи = СтрокаМаршрута.КлючСвязи;
	СтрокаМаршрута.Вес = 0;
	СтрокаМаршрута.Объем = 0;

	Для Каждого СтрокаРаспоряжений Из Объект.Распоряжения Цикл

		Если МассивКодовСтрок.Найти(СтрокаРаспоряжений.КлючСвязи)<>Неопределено Тогда
			СтрокаРаспоряжений.КлючСвязи = НовыйКлючСвязи;
			СтрокаМаршрута.Вес = СтрокаМаршрута.Вес + СтрокаРаспоряжений.Вес;
			СтрокаМаршрута.Объем = СтрокаМаршрута.Объем + СтрокаРаспоряжений.Объем; 
			#Вставка     
			// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 21:02:11] +
			СтрокаМаршрута.бит_КоличествоМест = СтрокаМаршрута.бит_КоличествоМест + СтрокаРаспоряжений.бит_КоличествоМест;
			// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 21:02:08] -
			#КонецВставки
		КонецЕсли;	

	КонецЦикла;	

	СтрокаПропущена = Ложь;
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		Если Не СтрокаПропущена Тогда
			СтрокаПропущена = Истина;
			Продолжить;
		КонецЕсли;

		Объект.Маршрут.Удалить(Объект.Маршрут.НайтиПоИдентификатору(Идентификатор));

	КонецЦикла;

	ОбновляемыеСтроки = Новый Массив;
	ОбновляемыеСтроки.Добавить(СтрокаМаршрута);
	ЗаполнитьСлужебныеРеквизитыМаршрута(ОбновляемыеСтроки);

КонецФункции

&НаСервере
&ИзменениеИКонтроль("ОбновитьВесИОбъемСтрокиМаршрута")
Процедура бит_ОбновитьВесИОбъемСтрокиМаршрута(СтрокаМаршрута)

	СтрокиРаспоряжения = Объект.Распоряжения.НайтиСтроки(Новый Структура("КлючСвязи",СтрокаМаршрута.КлючСвязи));

	СтрокаМаршрута.Вес = 0;
	СтрокаМаршрута.Объем = 0;
	#Вставка
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 21:11:37] +
	СтрокаМаршрута.бит_КоличествоМест = 0;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 21:11:39] -
	#КонецВставки

	Для Каждого СтрокаРаспоряжений Из СтрокиРаспоряжения Цикл

		СтрокаМаршрута.Вес = СтрокаРаспоряжений.Вес + СтрокаМаршрута.Вес;
		СтрокаМаршрута.Объем = СтрокаРаспоряжений.Объем + СтрокаМаршрута.Объем;
        #Вставка     
		// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 21:11:07] +
		СтрокаМаршрута.бит_КоличествоМест = СтрокаРаспоряжений.бит_КоличествоМест + СтрокаМаршрута.бит_КоличествоМест;	
		// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 21:11:09] -
		#КонецВставки
	КонецЦикла;	 

КонецПроцедуры

&НаКлиенте
Процедура бит_ПеревозчикПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:28:24] +        
	бит_ЗаполнитьДоговорПеревозчика();
	бит_ВидимостьЭлементов();
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:28:24] -
КонецПроцедуры

&НаСервере
Процедура бит_ЗаполнитьДоговорПеревозчика()
	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:30:07] +        
	Если Объект.ЗаданиеВыполняет <> Перечисления.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик 
		Или Не ЗначениеЗаполнено(Объект.Перевозчик) Тогда
		Объект.бит_Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Иначе
		СтруктураДанных = Новый Структура("Партнер, Договор, Контрагент", Объект.Перевозчик, Объект.бит_Договор, Объект.Контрагент);
		Объект.бит_Договор = бит_ПартнерыИКонтрагентыСервер.ПолучитьДоговорПоУмолчанию(СтруктураДанных);
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:30:07] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ВидимостьЭлементов()
	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:30:40] +        
	Если Элементы.Найти("бит_Договор") <> Неопределено Тогда
		Элементы.бит_Договор.Видимость = (Объект.ЗаданиеВыполняет = ПредопределенноеЗначение("Перечисление.ТипыИсполнителейЗаданийНаПеревозку.Перевозчик")); 
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:30:40] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ПриОткрытииПосле(Отказ)
	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:31:55] +        
	бит_ВидимостьЭлементов();
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:31:55] -
КонецПроцедуры

&НаКлиенте
Процедура бит_ЗаданиеВыполняетПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:33:09] +  
	бит_ВидимостьЭлементов();
	бит_ЗаполнитьДоговорПеревозчика();
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 18:33:09] -
КонецПроцедуры 

&НаКлиенте
Процедура бит_КонтрагентПриИзмененииПосле(Элемент)
	// {{ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 19:12:22] +        
	бит_ЗаполнитьДоговорПеревозчика();
	// }}ПервыйБИТ ЛистТребований [ЛТ2.6]  [VUVaynula@1cbit.ru] [12.08.2025 19:12:22] -
КонецПроцедуры
